artillery/scenarios/pim/employee-list.yml
config:
  target: "https://opensource-demo.orangehrmlive.com"
  phases:
    - duration: 20
      arrivalRate: 1
      rampTo: 2
  engines:
    playwright: {}
  processor: "./employee-list.js"

scenarios:
  - name: TC-PIM-EMPLIST-001 - employee list load flow
    engine: playwright
    testFunction: employeeListLoadFlow